# **Extract Transform Load (ETL)**

## Objectives

The objective of this notebook is to: 
- **Extract** raw data from a csv file downloaded from Kaggle
- **Transform** and clean the extracted data
- **Load** processed data into the cleaned data folder as a csv file

## Prerequisites
- Python 3.12.8 is installed
- Required Python Libaries from `requirements.txt` and their dependencies must be installed
- Optional to set up Python virtual enviornment

## Inputs

- `heart_data.csv` file
- Data source: https://data.world/kudem/heart-disease-dataset
- Data author: [Kuzak Dempsy](https://data.world/kudem)
- Kaggle download link: https://www.kaggle.com/datasets/thedevastator/exploring-risk-factors-for-cardiovascular-diseas 

## Outputs

* Cleaned dataset saved as `cleaned_heart_data.csv`.

## Additional Comments
- The transformations on the data in this section aims to mainly clean the dataset. More indepth analysis of the dataset will take place in a dedicated EDA section later on.

---

# Change working directory

The working directory must be changed from its current folder to its parent folder
* The current directory can be accessed with `os.getcwd()`

In [1]:
import os
current_dir = os.getcwd()
current_dir

'c:\\Users\\fanxi\\OneDrive\\Documents\\Code projects\\Capstone\\analysis-of-risk-factors-for-cardiovascular-diseases\\jupyter_notebooks'

The parent of the current directory will be the new current directory
* os.path.dirname() gets the parent directory
* os.chir() defines the new current directory

In [2]:
os.chdir(os.path.dirname(current_dir))
print("You set a new current directory")

You set a new current directory

Confirm the new current directory

In [3]:
current_dir = os.getcwd()
current_dir

'c:\\Users\\fanxi\\OneDrive\\Documents\\Code projects\\Capstone\\analysis-of-risk-factors-for-cardiovascular-diseases'

---

# ETL: Extraction

In this section, a pandas DataFrame will be extracted from the csv file. 

Firstly, Import essential libaries for ETL before data extraction.

In [4]:
import pandas as pd
import numpy as np

Use `.read_csv()` to read the csv file and save it as a pandas DataFrame.

In [5]:
df = pd.read_csv('data/raw/heart_data.csv') # Directory of the input csv file
df.head()

,index,id,age,gender,height,weight,ap_hi,ap_lo,cholesterol,gluc,smoke,alco,active,cardio
0,0,0,18393,2,168,62.0,110,80,1,1,0,0,1,0
1,1,1,20228,1,156,85.0,140,90,3,1,0,0,1,1
2,2,2,18857,1,165,64.0,130,70,3,1,0,0,0,1
3,3,3,17623,2,169,82.0,150,100,1,1,0,0,1,1
4,4,4,17474,1,156,56.0,100,60,1,1,0,0,0,0

Current DataFrame contains 14 different columns/features. The table below contains the name of the original features and a description of each.

|Name of feature|Description|Data type|
| ----------- | ----------- | ----------- |
|`index`|Index of the entry|Integer|
|`id`|Unique identifier assigned to each person|Integer|
|`age`|Age of the person in days|Integer|
|`gender`|Gender of the person, 1 = male, 2 = female|Integer|
|`height`|Height of the person in cm|Integer|
|`weight`|Weight of the person in kg|Float|
|`ap_hi`|Systolic blood pressure reading|Integer|
|`ap_lo`|Diastolic blood pressure reading|Integer|
|`cholesterol`|Cholesterol level|Integer|
|`gluc`|Glucose level|Integer|
|`smoke`|Smoking status, 0 = non smoker, 1 = smoker|Integer|
|`alco`|Alcohol status, 0 = do not consume alcohol, 1 = consume alcohol|Integer|
|`active`|Physical activity status, 0 = non active, 1= active|Integer|
|`cardio`|Presence of cardiovascular disease, 0 = non present, 1 = present|Integer|

---

# ETL: Transformation

In this section, descriptive analysis will be done to get an overview of the DataFrame. The DataFrame will then be transformed and cleaned. More indepth transformations of the DataFrame such as finding and handling outliers will be explored in a dedicated EDA notebook.

Index column is not needed as a pandas DataFrame already has indexing. It will therefore be removed.

In [6]:
df.drop(columns=['index'], inplace=True)
df.head()

,id,age,gender,height,weight,ap_hi,ap_lo,cholesterol,gluc,smoke,alco,active,cardio
0,0,18393,2,168,62.0,110,80,1,1,0,0,1,0
1,1,20228,1,156,85.0,140,90,3,1,0,0,1,1
2,2,18857,1,165,64.0,130,70,3,1,0,0,0,1
3,3,17623,2,169,82.0,150,100,1,1,0,0,1,1
4,4,17474,1,156,56.0,100,60,1,1,0,0,0,0

## Initial data summary

After removing the index column, the dimensions of the DataFrame can be checked using `.shape`. The output of `(70000, 13)` indicates a total of 70000 entries of data with 13 different features.

In [7]:
df.shape

(70000, 13)

A basic summary of the DataFrame is produced using `df.info()`. Each column have 70000 non-null values, suggesting no missing values. All 13 columns consists of numerical values, with the `weight` column having a float dtype.

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70000 entries, 0 to 69999
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           70000 non-null  int64
 1   age          70000 non-null  int64
 2   gender       70000 non-null  int64
 3   height       70000 non-null  int64
 4   weight       70000 non-null  float64
 5   ap_hi        70000 non-null  int64
 6   ap_lo        70000 non-null  int64
 7   cholesterol  70000 non-null  int64
 8   gluc         70000 non-null  int64
 9   smoke        70000 non-null  int64
 10  alco         70000 non-null  int64
 11  active       70000 non-null  int64
 12  cardio       70000 non-null  int64
dtypes: float64(1), int64(12)
memory usage: 6.9 MB

## Handling missing values
The existance of any missing values can be confirmed using `.isnull().sum()`. It sums all null values in each column. Output of 0 for all columns means that there are no missing values.

In [9]:
df.isnull().sum()

id             0
age            0
gender         0
height         0
weight         0
ap_hi          0
ap_lo          0
cholesterol    0
gluc           0
smoke          0
alco           0
active         0
cardio         0
dtype: int64

Any duplicated entries are checked with `.duplicated().sum()`. Output of 0 means no instances of duplicated entries.

In [10]:
df.duplicated().sum()

0

## Changing data types

Some columns have numerical dtypes when they should have categorical dtypes. Columns such as age should be converted to categorical data to allow for easier categorical operations such as grouping and segmentation later on.

Starting with the **'id'** column. Normally, it is better to convert it to a categorical data type if there are multiple entries with the same id. But as there are no duplicated id values, seen by the 7000 counts of unique values, conversion is not needed.

Other columns with only 2 or 3 unique values should be converted into a categorical dtype as they are not continuous.

In [11]:
'''Check the number of unique values in each column'''

df.nunique()

id             70000
age             8076
gender             2
height           109
weight           287
ap_hi            153
ap_lo            157
cholesterol        3
gluc               3
smoke              2
alco               2
active             2
cardio             2
dtype: int64

The other values are converted to a category dtype.

In [12]:
'''Convert categorical columns from 'int64' to 'category' dtype'''

catag_cols = ['gender', 'cholesterol', 'gluc', 'smoke', 'alco', 'active', 'cardio']
df[catag_cols] = df[catag_cols].astype('category')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70000 entries, 0 to 69999
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           70000 non-null  int64
 1   age          70000 non-null  int64
 2   gender       70000 non-null  category
 3   height       70000 non-null  int64
 4   weight       70000 non-null  float64
 5   ap_hi        70000 non-null  int64
 6   ap_lo        70000 non-null  int64
 7   cholesterol  70000 non-null  category
 8   gluc         70000 non-null  category
 9   smoke        70000 non-null  category
 10  alco         70000 non-null  category
 11  active       70000 non-null  category
 12  cardio       70000 non-null  category
dtypes: category(7), float64(1), int64(5)
memory usage: 3.7 MB

## Handling impossible values

An overview of the distribution of the numerical data can be obtained using `.describe()`. From the statistics generated, the maximum and minimum values of each features can be seen. 

The minimum values for `height`, `weight` and `age` are all very small, but it can be a statistical outlier and are not impossible(e.g. a small child). This will be investigated further in the EDA. 

However, the minimum and maximum values for `ap_hi` and `ap_lo` are not possible and likely data errors. A realistic range for systolic and diastolic pressure is between 60–250 and 30–150, respectively. Anything outside of that range is clinically implausable. The min and max values shown in the data are far outside of that range.

In [18]:
'''Check the summary statistics of numerical columns'''

df.select_dtypes(exclude=['category']).describe()

,id,age,height,weight,ap_hi,ap_lo
count,70000.000000,70000.000000,70000.000000,70000.000000,70000.000000,70000.000000
mean,49972.419900,19468.865814,164.359229,74.205690,128.817286,96.630414
std,28851.302323,2467.251667,8.210126,14.395757,154.011419,188.472530
min,0.000000,10798.000000,55.000000,10.000000,-150.000000,-70.000000
25%,25006.750000,17664.000000,159.000000,65.000000,120.000000,80.000000
50%,50001.500000,19703.000000,165.000000,72.000000,120.000000,80.000000
75%,74889.250000,21327.000000,170.000000,82.000000,140.000000,90.000000
max,99999.000000,23713.000000,250.000000,200.000000,16020.000000,11000.000000

There are 1239 entries with unrealistic blood pressure readings.

In [ ]:
'''Find entries with unrealistic systolic or diastolic BP'''
df[(df["ap_hi"] < 60) | (df["ap_hi"] > 250) | (df["ap_lo"] < 30) | (df["ap_lo"] > 150)]

,id,age,gender,height,weight,ap_hi,ap_lo,cholesterol,gluc,smoke,alco,active,cardio
228,314,17489,2,183,98.0,160,1100,1,2,1,0,1,1
241,334,21932,2,157,60.0,160,1000,2,1,0,0,0,1
260,357,18217,1,150,83.0,140,800,1,1,0,0,1,1
329,458,23407,1,176,63.0,160,1000,2,2,0,0,0,1
345,482,18704,1,154,81.0,140,1000,2,1,0,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
69771,99659,23330,1,167,81.0,160,1000,1,1,0,0,1,1
69872,99798,21808,1,152,56.0,160,1000,1,1,0,0,1,1
69878,99807,21239,2,168,95.0,160,1000,1,1,0,0,1,1
69885,99816,22417,2,166,78.0,170,1000,1,1,0,0,0,0
69967,99955,21416,2,168,63.0,140,1000,1,1,0,0,1,1

Negative values for `ap_hi` and `ap_lo` are assumed to be input errors and changed to positive values. The minimum and Maximum values are still far outside of the acceptable range.

In [16]:
'''Make systolic and diastolic blood pressure values positive'''
df['ap_hi'] = df[['ap_hi']].abs()
df['ap_lo'] = df[['ap_lo']].abs()
df.select_dtypes(exclude=['category']).describe()

,id,age,height,weight,ap_hi,ap_lo
count,70000.000000,70000.000000,70000.000000,70000.000000,70000.000000,70000.000000
mean,49972.419900,19468.865814,164.359229,74.205690,128.841429,96.632414
std,28851.302323,2467.251667,8.210126,14.395757,153.991223,188.471505
min,0.000000,10798.000000,55.000000,10.000000,1.000000,0.000000
25%,25006.750000,17664.000000,159.000000,65.000000,120.000000,80.000000
50%,50001.500000,19703.000000,165.000000,72.000000,120.000000,80.000000
75%,74889.250000,21327.000000,170.000000,82.000000,140.000000,90.000000
max,99999.000000,23713.000000,250.000000,200.000000,16020.000000,11000.000000

There are still 1232 entries with unrealistic blood pressure readings after making all values positive.

In [17]:
'''Find entries with unrealistic systolic or diastolic BP'''
df[(df["ap_hi"] < 60) | (df["ap_hi"] > 250) | (df["ap_lo"] < 30) | (df["ap_lo"] > 150)]

,id,age,gender,height,weight,ap_hi,ap_lo,cholesterol,gluc,smoke,alco,active,cardio
228,314,17489,2,183,98.0,160,1100,1,2,1,0,1,1
241,334,21932,2,157,60.0,160,1000,2,1,0,0,0,1
260,357,18217,1,150,83.0,140,800,1,1,0,0,1,1
329,458,23407,1,176,63.0,160,1000,2,2,0,0,0,1
345,482,18704,1,154,81.0,140,1000,2,1,0,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
69771,99659,23330,1,167,81.0,160,1000,1,1,0,0,1,1
69872,99798,21808,1,152,56.0,160,1000,1,1,0,0,1,1
69878,99807,21239,2,168,95.0,160,1000,1,1,0,0,1,1
69885,99816,22417,2,166,78.0,170,1000,1,1,0,0,0,0
69967,99955,21416,2,168,63.0,140,1000,1,1,0,0,1,1

In [22]:
df[(df["ap_hi"] < 60) | (df["ap_hi"] > 250) | (df["ap_lo"] < 30) | (df["ap_lo"] > 150)].describe()

,id,age,height,weight,ap_hi,ap_lo
count,1232.000000,1232.000000,1232.000000,1232.000000,1232.000000,1232.000000
mean,50126.608766,19721.268669,164.214286,78.913799,253.230519,949.594968
std,29239.541719,2400.673766,9.523643,16.950492,1147.602819,1128.531610
min,314.000000,14297.000000,66.000000,10.000000,1.000000,0.000000
25%,25600.000000,18178.500000,158.000000,68.000000,140.000000,901.750000
50%,49629.500000,19885.500000,165.000000,76.000000,150.000000,1000.000000
75%,76250.750000,21690.500000,170.000000,89.000000,160.000000,1000.000000
max,99955.000000,23652.000000,200.000000,181.000000,16020.000000,11000.000000

---

# ETL: Load

In this section, the cleaned DataFrame will be saved as a csv file named `cleaned_heart_data.csv`.

In [12]:
dir = 'data/cleaned/cleaned_heart_data.csv'
df.to_csv(dir, index=False) # Directory of the output csv file
print(f"Cleaned data saved to {dir}")

Cleaned data saved to data/cleaned/cleaned_heart_data.csv

---

# Conclusion

- A basic cleaning of the dataset has been completed.
- Cleaned dataset saved as a csv file.
- More indepth analysis and transformation of the dataset will be conducted in the following EDA section.